
// ПЪРВА ЧАСТ

/* Първата част се състои в това да вземеш данните от полетата, да ги вкараш в списък и да закачиш списъка към втората част.

- Стъпка 1 - взимаш си референции към нужните полета по id, към бутони, формата и средната част

- Стъпка 2 - правиш си един празен обект за съхранение на данните,
            - създаваш си li елемента предварително, за да може да си го ползваш после навсякъде, слагаш му клас.
            - създаваш си и бутоните които песле ще добавяш към li-елемента. Името и класът им ги взимаш от дадения в 
            задачата html и ги сетваш - btn.className и btn.TextContent задължително и двете неща трябва да ги имат.

- Стъпка 3 - слагаш слушатели един click слушател на бутона на формата и един click слушател на li - елемента.
            - слушателя на li-то направо му задаваш за кои бутони да слуша и кои функции да вика.
            li.addEventListener('click', (event) => {
                if (event.target.tagName === 'BUTTON') {
                        if (event.target.textContent === 'Save Story') {
                        saveStory();
                    } else if (event.target.textContent === 'Edit Story') {
                        editStory();
                    } else if (event.target.textContent === 'Delete Story') {
                        deleteStory();
                    }
                }

            - създай си тези няколко празни функции да са готови за после, иначе сега кода ти няма да работи без тях ето така

            function editStory() {

            }

- Стъпка 4 - добавяш информацията от полетата в празния обект за бекъп.
            Първо да не забравиш в събмит функцията си да приемеш евента, иначе не може да го ползваш.
            function submit(event) {
                event.preventDefault();     -  и това също задължително!

                    backupData = {
                        firstName: firstName.value,
                        lastname: lastname.value,
                        age: age.value,
                        storyTitle: storyTitle.value,
                        genre: genre.value,
                        story: story.value
                        }

                - правиш проверка за валидност - ако има празни полета в обекта - return
                if (Object.values(backupData).some(x => x === '')) return;

                - копираш данните от дадения в задачата html - та са на снимка , аз ползвам сайта - https://www.imagetotext.info/ 
                там извличането става лесно, може направо на пейстнеш снимката там с копи и пейст. 
                Другия вариант е да ги напишеш ръчно. От тези данни не трябва да забравиш да махнеш li-то и бутоните, остава само
                вътрешната част, която обикновенно е article с няколко параграфа.

                        li.innerHTML = `
                            <article>
                                <h4>Name: ${firstName.value} ${lastname.value}</h4>
                                <p>Age: ${age.value}</p>
                                <p>Title: ${storyTitle.value}</p>
                                <p>Genre: ${genre.value}</p>
                                <p>${story.value}</p>
                            </article>`

                Когато ползваш innerHtml ползваш интерполационен стринг ``, за да си вкараш вътре данните. 
                - вкарваш данните вътре като внимаваш всичко да си е форматирано както трябва.

- Стъпка 5 - добавяш li елемента към средната част с appendchild(li), добавяш и бутоните към него пак с appendChild,
            като редът на бутоните е такъв какъвто е отляво надясно на снимките.
           - нулираш данните във формата - това става бързо и лесно със  document.querySelector('form').reset();            
            -  изключваш бутона на формата, има различни начини, аз му добавям атрибута disabled = true.
            publishBtn.setAttribute('disabled', 'true');

            КРАЙ НА ПЪРВА ЧАСТ - може да тестваш дотука в джъдж колко имаш - трябва първите 5-6 теста да светнат в зелено.
                                Ако има някой от тях червен х значи някъде има грешка.


                                ВТОРА ЧАСТ
                            
    - Стъпка 1 - правиш edit бутона да работи в edit функцята която горе зададохме да се извиква от li-слушателя,
                Връщаш данните от бекъп обекта обратно в полетата -

                firstName.value = backupData.firstName;
                lastname.value = backupData.lastname;
                age.value = backupData.age;
                storyTitle.value = backupData.storyTitle;
                
                ----това е за селект менюто ако има такова

                Array.from(genre.options).forEach(option => {
                if (option.value === backupData.genre) option.selected = true;
                })

                story.value = backupData.story;

                - активираш отново бутона във формата
                    publishBtn.removeAttribute('disabled');

                - премахваш li-елемента от средната част. махаме и бутоните понеже при повторно добавяне
                има вероятност да се удвоят.
                li.remove();
                btnDelete.remove();
                btnEdit.remove();
                btnSave.remove();

                КРАЙ НА ВТОРА ЧАСТ - може да тестваш в джъдж - трябва да останат 2-3 теста само до края


                ТРЕТА ЧАСТ - ФИНАЛЪТ!!!

    - правиш следващия бутон да работи, в случая това е бутона Save. тук се иска само да се замени
    съдържанието на div-а main с едно заглавие - правим го.

        function saveStory() {
                document.querySelector('#main').innerHTML = `<h1>Your scary story is saved!</h1>`;
            }

    - правиш бутона Delete да работи - общо взето това е копи и пейст на края на 2-ра част - 
            премахва li-то и активира бутона на формата.

            function deleteStory() {
                    li.remove();
                    btnDelete.remove();
                    btnEdit.remove();
                    btnSave.remove();
                    publishBtn.removeAttribute('disabled');
                }

                КРАЙ НА ТРЕТА ЧАСТ!!!

                трябва тестовете в джъдж да минават на 100.
*/

// Допълнение - понякога за втори бутон се иска li-то да се премести в третата част вдясно. Местиш с appendchild() към третата част.
//              също се иска и смяна на бутоните. Най-добре е те също да са предварително направени горе при останалите бутони.
//      Също така горе в слушателя на li-то да ги имаш добавени да слуша и за тях.
//      След това като преместиш li-елемента в третата част, просто махаш излишните бутони с btnEdit.remove(); примерно и
//      добавяш другите бутони с li.appendchild(). Съответно правиш функциите които викат тези бутони да работят и това е.
//